# Домашнее задание к лекции "Библиотека Pandas"
## Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [3]:
movies = pd.read_csv('movies.csv')
movies[['movieId','title']].head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [4]:
ratings = pd.read_csv('ratings.csv')
ratings = ratings[['movieId','rating']]
ratings.head()

   movieId  rating
0      296     5.0
1      306     3.5
2      307     5.0
3      665     5.0
4      899     3.5

In [5]:
films = ratings.merge(movies, on='movieId', how='left')
films[['movieId','rating','title']].head()

   movieId  rating                                             title
0      296     5.0                               Pulp Fiction (1994)
1      306     3.5  Three Colors: Red (Trois couleurs: Rouge) (1994)
2      307     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)
3      665     5.0                                Underground (1995)
4      899     3.5                        Singin' in the Rain (1952)

In [6]:
max_films = films[(films['rating'] == 5.0)].groupby(['movieId' , 'title'])['movieId'].count().sort_values(ascending=False)
max_films.head()

movieId  title
318      Shawshank Redemption, The (1994)             39553
296      Pulp Fiction (1994)                          32169
356      Forrest Gump (1994)                          25918
260      Star Wars: Episode IV - A New Hope (1977)    25804
2571     Matrix, The (1999)                           25482
Name: movieId, dtype: int64

## Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [7]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [8]:
countries = power[(power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]
countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [26]:
categories = countries[(countries['category'] == 4) | (countries['category'] == 12) | (countries['category'] == 21)] 
categories_years = categories [(categories['year'] <= 2010) & (categories['year'] >= 2005)]
categories_years.sort_values(by = 'year', ascending = False).head()

          country  year  quantity  category
106076  Lithuania  2010       9.0        12
26466      Latvia  2010       0.0         4
228539     Latvia  2010      23.0        21
218600  Lithuania  2010       0.0        21
102983  Lithuania  2010     -30.0        12

In [24]:
results = categories_years[(categories_years['quantity'] > 0.0)]
results['quantity'].sum()

240580.0

In [20]:
print('Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно {} КВт'.format(results['quantity'].sum()))

Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно 240580.0 КВт

## Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [30]:
data = pd.read_html('https://fortrader.org/quotes')[2]
data.head()

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 864      -0.00         -0.00        NaN
1  Серебро Цена на серебро на бирже  27.73       0.05          0.18        NaN
2         Палладий Цена на Палладий  2 759      -6.00         -0.00        NaN
3           Платина Цены на платину  1 148      -7.00         -1.00        NaN
4           Медь Цена меди на бирже   4.32      -0.02         -0.52        NaN